# Introduction to Pandas:

Purpose: Pandas is a Python library designed for efficient data manipulation and analysis.

Data Structures:

DataFrame: Two-dimensional table for structured data manipulation.
Series: One-dimensional labeled array for individual columns or rows.
Data Cleaning:

Pandas simplifies tasks like handling missing data and reshaping.
Selection and Slicing:

Offers powerful tools for selecting, indexing, and slicing data.
Grouping and Aggregation:

Supports grouping data based on criteria and performing aggregate functions.
IO Tools:

Reads and writes data in various formats like CSV, Excel, and SQL databases.

# <span style="color:blue">History of Pandas:</span>

Initiation (2008):

Created by Wes McKinney to handle financial data.
Inspiration from R:

Borrowed concepts from R's data frames.
Community Adoption:

Quickly gained popularity within the data science community.
Open Source:

Thrives on contributions from a global developer community.
Integration:

Seamlessly integrates with NumPy, Matplotlib, and scikit-learn.

# <span style="color:green; font-weight:bold;">Present Day:</span>


Data Science Cornerstone:

Integral part of the Python data science stack.
Ease of Use:

Known for simplicity and versatility in data manipulation.
Community-Driven Evolution:

Regular updates and contributions from the open-source community.
Ecosystem Integration:

Forms a comprehensive ecosystem with other Python libraries.

# <span style="color:blue">History of Pandas:</span>
# <span style="color:green; font-weight:bold;">Present Day:</span>

In [1]:
import pandas as pd

C:\Users\LENOVO\anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\LENOVO\anaconda3\lib\site-packages\numpy\.libs\libopenblas.WCDJNK7YVMPZQ2ME2ZZHJJRJ3JIKNDB7.gfortran-win_amd64.dll
C:\Users\LENOVO\anaconda3\lib\site-packages\numpy\.libs\libopenblas64__v0.3.21-gcc_10_3_0.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

In [2]:
df = pd.read_csv(r"D:\My Download\Sample.csv.csv")

In [3]:
df2 = pd.read_csv("D:\My Download\Sample.csv.csv")

df2.head(3)

   ID   Name  Age  Gender         City  Salary
0   1   John   25    Male     New York   50000
1   2   Mary   30  Female      Chicago   60000
2   3  David   22    Male  Los Angeles   55000

In [4]:
df2.tail(20)

    ID      Name  Age  Gender           City  Salary
0    1      John   25    Male       New York   50000
1    2      Mary   30  Female        Chicago   60000
2    3     David   22    Male    Los Angeles   55000
3    4      Emma   28  Female  San Francisco   62000
4    5   Michael   35    Male        Seattle   70000
5    6   Jessica   32  Female         Austin   58000
6    7     Brian   40    Male         Boston   75000
7    8    Olivia   26  Female         Denver   56000
8    9     Ethan   29    Male       Portland   61000
9   10    Sophia   27  Female        Atlanta   59000
10  11  Benjamin   33    Male      San Diego   68000
11  12       Ava   31  Female         Dallas   64000
12  13     Lucas   24    Male        Houston   52000
13  14       Mia   35  Female          Miami   72000
14  15   Jackson   28    Male    Minneapolis   59000
15  16      Aria   36  Female   Philadelphia   78000
16  17     Logan   30    Male        Phoenix   67000
17  18     Grace   29  Female      Nashville   61000
18  19    Oliver   34    Male        Detroit   70000
19  20      Lily   27  Female        Raleigh   60000

In [5]:
df.head()

   ID     Name  Age  Gender           City  Salary
0   1     John   25    Male       New York   50000
1   2     Mary   30  Female        Chicago   60000
2   3    David   22    Male    Los Angeles   55000
3   4     Emma   28  Female  San Francisco   62000
4   5  Michael   35    Male        Seattle   70000

In [6]:
df.tail()

    ID    Name  Age  Gender          City  Salary
15  16    Aria   36  Female  Philadelphia   78000
16  17   Logan   30    Male       Phoenix   67000
17  18   Grace   29  Female     Nashville   61000
18  19  Oliver   34    Male       Detroit   70000
19  20    Lily   27  Female       Raleigh   60000

In [7]:
df.describe()

             ID        Age        Salary
count  20.00000  20.000000     20.000000
mean   10.50000  30.050000  62850.000000
std     5.91608   4.501169   7527.318667
min     1.00000  22.000000  50000.000000
25%     5.75000  27.000000  58750.000000
50%    10.50000  29.500000  61000.000000
75%    15.25000  33.250000  68500.000000
max    20.00000  40.000000  78000.000000

In [8]:


# Creating a DataFrame from a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [22, 24, 23, 21, 25],
    'Test_Score': [85, 90, 78, 92, 88]
}

df5 = pd.DataFrame(data)


print(df5)

      Name  Age  Test_Score
0    Alice   22          85
1      Bob   24          90
2  Charlie   23          78
3    David   21          92
4      Eva   25          88

In [9]:



test_scores = [85, 90, 78, 92, 88]

# Using default integer index
scores_series = pd.Series(test_scores)

# Display the Series
print(scores_series)

0    85
1    90
2    78
3    92
4    88
dtype: int64

In [10]:
## save in excel format = df = pd.DataFrame(data)
# Save DataFrame to Excel
df5.to_csv('student_.csv', index=False)
# Save DataFrame to Excel
#df5.to_excel('student_.xlsx', index=False)

In [11]:
df = pd.DataFrame(data)

# Save DataFrame to Excel
df.to_excel('student_data.xlsx', index=False)

# <span style="color:green; font-weight:bold;">Inspect Data:</span>

In [12]:
df2.shape

(20, 6)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Test_Score  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [14]:
# Get a random sample of rows from the DataFrame
random_sample = df.sample(1)  # Change 'n' to the desired number of rows
print(random_sample)

  Name  Age  Test_Score
1  Bob   24          90

In [15]:
df2.nlargest(1, 'Age')

   ID   Name  Age Gender    City  Salary
6   7  Brian   40   Male  Boston   75000

In [16]:
df2.nsmallest(2, 'Salary')

    ID   Name  Age Gender      City  Salary
0    1   John   25   Male  New York   50000
12  13  Lucas   24   Male   Houston   52000

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Test_Score  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

Adding a New Column:

In [18]:
df

      Name  Age  Test_Score
0    Alice   22          85
1      Bob   24          90
2  Charlie   23          78
3    David   21          92
4      Eva   25          88

In [19]:
# New column data
new_column_data = [10, 15, 12, 18,55]

# Add the new column to the DataFrame
df['New_Column2'] = new_column_data

# Display the DataFrame with the new column
print(df)

      Name  Age  Test_Score  New_Column2
0    Alice   22          85           10
1      Bob   24          90           15
2  Charlie   23          78           12
3    David   21          92           18
4      Eva   25          88           55

In [21]:
column = ["anuu",'Monu', 'Sonu', 'Sunil','Sunny']
df['dominoz'] = column 
print(df)

      Name  Age  Test_Score  New_Column2 dominoz
0    Alice   22          85           10    anuu
1      Bob   24          90           15    Monu
2  Charlie   23          78           12    Sonu
3    David   21          92           18   Sunil
4      Eva   25          88           55   Sunny

In [22]:
# New row data
new_row_data = {'Name': 'Frank', 'Age': 26, 'Test_Score': 95, 'New_Column':50}

# Add the new row to the DataFrame
df = df.append(new_row_data, ignore_index=True)

# Display the DataFrame with the new row
print(df)

      Name  Age  Test_Score  New_Column2 dominoz  New_Column
0    Alice   22          85         10.0    anuu         NaN
1      Bob   24          90         15.0    Monu         NaN
2  Charlie   23          78         12.0    Sonu         NaN
3    David   21          92         18.0   Sunil         NaN
4      Eva   25          88         55.0   Sunny         NaN
5    Frank   26          95          NaN     NaN        50.0

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_5248\1630353872.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_row_data, ignore_index=True)

In [23]:
new_row_data = {'Name': 'Manshi','Age':88, 'Test_Score':88}
df = df.append(new_row_data, ignore_index =True)
print(df)

      Name  Age  Test_Score  New_Column2 dominoz  New_Column
0    Alice   22          85         10.0    anuu         NaN
1      Bob   24          90         15.0    Monu         NaN
2  Charlie   23          78         12.0    Sonu         NaN
3    David   21          92         18.0   Sunil         NaN
4      Eva   25          88         55.0   Sunny         NaN
5    Frank   26          95          NaN     NaN        50.0
6   Manshi   88          88          NaN     NaN         NaN

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_5248\3014677061.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_row_data, ignore_index =True)

In [24]:
new_row_data = {'dominoz ': 'Drink'}
df = df.append(new_row_data, ignore_index =True)
print(df)

      Name   Age  Test_Score  New_Column2 dominoz  New_Column dominoz
0    Alice  22.0        85.0         10.0    anuu         NaN      NaN
1      Bob  24.0        90.0         15.0    Monu         NaN      NaN
2  Charlie  23.0        78.0         12.0    Sonu         NaN      NaN
3    David  21.0        92.0         18.0   Sunil         NaN      NaN
4      Eva  25.0        88.0         55.0   Sunny         NaN      NaN
5    Frank  26.0        95.0          NaN     NaN        50.0      NaN
6   Manshi  88.0        88.0          NaN     NaN         NaN      NaN
7      NaN   NaN         NaN          NaN     NaN         NaN    Drink

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_5248\3430881389.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_row_data, ignore_index =True)

In [25]:
# Sort rows by values of the 'Test_Score' column (low to high)
sorted_df_low_to_high = df.sort_values('Test_Score')
#print("\nSorted DataFrame (low to high Test_Score):")
print(sorted_df_low_to_high)

Sorted DataFrame (low to high Test_Score):
      Name   Age  Test_Score  New_Column2 dominoz  New_Column dominoz
2  Charlie  23.0        78.0         12.0    Sonu         NaN      NaN
0    Alice  22.0        85.0         10.0    anuu         NaN      NaN
4      Eva  25.0        88.0         55.0   Sunny         NaN      NaN
6   Manshi  88.0        88.0          NaN     NaN         NaN      NaN
1      Bob  24.0        90.0         15.0    Monu         NaN      NaN
3    David  21.0        92.0         18.0   Sunil         NaN      NaN
5    Frank  26.0        95.0          NaN     NaN        50.0      NaN
7      NaN   NaN         NaN          NaN     NaN         NaN    Drink

In [26]:
# Sort rows by values of the 'Test_Score' column (high to low)
sorted_df_high_to_low = df.sort_values('Test_Score', ascending=False)
print("\nSorted DataFrame (high to low Test_Score):")
print(sorted_df_high_to_low)

Sorted DataFrame (high to low Test_Score):
      Name   Age  Test_Score  New_Column2 dominoz  New_Column dominoz
5    Frank  26.0        95.0          NaN     NaN        50.0      NaN
3    David  21.0        92.0         18.0   Sunil         NaN      NaN
1      Bob  24.0        90.0         15.0    Monu         NaN      NaN
4      Eva  25.0        88.0         55.0   Sunny         NaN      NaN
6   Manshi  88.0        88.0          NaN     NaN         NaN      NaN
0    Alice  22.0        85.0         10.0    anuu         NaN      NaN
2  Charlie  23.0        78.0         12.0    Sonu         NaN      NaN
7      NaN   NaN         NaN          NaN     NaN         NaN    Drink

In [28]:
# Rename the 'dominoz' column to 'Number_of_Dominos'
renamed_df = df.rename(columns={'dominoz': 'Buger'})
print("\nDataFrame with Renamed Column:")
print(renamed_df)

DataFrame with Renamed Column:
      Name   Age  Test_Score  New_Column2  Buger  New_Column dominoz
0    Alice  22.0        85.0         10.0   anuu         NaN      NaN
1      Bob  24.0        90.0         15.0   Monu         NaN      NaN
2  Charlie  23.0        78.0         12.0   Sonu         NaN      NaN
3    David  21.0        92.0         18.0  Sunil         NaN      NaN
4      Eva  25.0        88.0         55.0  Sunny         NaN      NaN
5    Frank  26.0        95.0          NaN    NaN        50.0      NaN
6   Manshi  88.0        88.0          NaN    NaN         NaN      NaN
7      NaN   NaN         NaN          NaN    NaN         NaN    Drink

In [29]:
# Sort the DataFrame based on the index
sorted_by_index_df = df.sort_index()
print("\nDataFrame Sorted by Index:")
print(sorted_by_index_df)

DataFrame Sorted by Index:
      Name   Age  Test_Score  New_Column2 dominoz  New_Column dominoz
0    Alice  22.0        85.0         10.0    anuu         NaN      NaN
1      Bob  24.0        90.0         15.0    Monu         NaN      NaN
2  Charlie  23.0        78.0         12.0    Sonu         NaN      NaN
3    David  21.0        92.0         18.0   Sunil         NaN      NaN
4      Eva  25.0        88.0         55.0   Sunny         NaN      NaN
5    Frank  26.0        95.0          NaN     NaN        50.0      NaN
6   Manshi  88.0        88.0          NaN     NaN         NaN      NaN
7      NaN   NaN         NaN          NaN     NaN         NaN    Drink

In [30]:
# Reset the index of the DataFrame
reset_index_df = df.reset_index()
print("\nDataFrame with Reset Index:")
print(reset_index_df)

DataFrame with Reset Index:
   index     Name   Age  Test_Score  New_Column2 dominoz  New_Column dominoz
0      0    Alice  22.0        85.0         10.0    anuu         NaN      NaN
1      1      Bob  24.0        90.0         15.0    Monu         NaN      NaN
2      2  Charlie  23.0        78.0         12.0    Sonu         NaN      NaN
3      3    David  21.0        92.0         18.0   Sunil         NaN      NaN
4      4      Eva  25.0        88.0         55.0   Sunny         NaN      NaN
5      5    Frank  26.0        95.0          NaN     NaN        50.0      NaN
6      6   Manshi  88.0        88.0          NaN     NaN         NaN      NaN
7      7      NaN   NaN         NaN          NaN     NaN         NaN    Drink

In [31]:

# Drop the 'dominoz' column
df_without_dominoz = df.drop(columns=['dominoz'])
#print("\nDataFrame after dropping 'dominoz' column:")
print(df_without_dominoz)

DataFrame after dropping 'dominoz' column:
      Name   Age  Test_Score  New_Column2  New_Column dominoz
0    Alice  22.0        85.0         10.0         NaN      NaN
1      Bob  24.0        90.0         15.0         NaN      NaN
2  Charlie  23.0        78.0         12.0         NaN      NaN
3    David  21.0        92.0         18.0         NaN      NaN
4      Eva  25.0        88.0         55.0         NaN      NaN
5    Frank  26.0        95.0          NaN        50.0      NaN
6   Manshi  88.0        88.0          NaN         NaN      NaN
7      NaN   NaN         NaN          NaN         NaN    Drink

In [ ]:
df.to_csv('Dominoz.csv', index=False)

# Reshap

In [32]:

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [22, 24, 23],
    'Test_Score': [85, 90, 78],
    'dominoz': [None, None, None]
}

# Create a DataFrame
df = pd.DataFrame(data)

# Melting the DataFrame
melted_df = pd.melt(df, id_vars=['Name', 'Age'], value_vars=['Test_Score', 'dominoz'], var_name='Variable', value_name='Value')

# Display the melted DataFrame
print("Melted DataFrame:")
print(melted_df)
print()

Melted DataFrame:
      Name  Age    Variable Value
0    Alice   22  Test_Score    85
1      Bob   24  Test_Score    90
2  Charlie   23  Test_Score    78
3    Alice   22     dominoz  None
4      Bob   24     dominoz  None
5  Charlie   23     dominoz  None

In [34]:
df.head()

      Name  Age  Test_Score dominoz
0    Alice   22          85    None
1      Bob   24          90    None
2  Charlie   23          78    None

In [36]:
# concatenate


data1 = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [22, 24, 23]}
data2 = {
     'Test_Score': [92, 88, 95, 88],
    'dominoz': [None, None, 50, None]
}

In [37]:

# Create DataFrames
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

# Concatenate or append rows
concatenated_df = pd.concat([df1, df2], ignore_index=True)

# Display the concatenated DataFrame
print("Concatenated DataFrame:")
print(concatenated_df)

Concatenated DataFrame:
      Name   Age  Test_Score  dominoz
0    Alice  22.0         NaN      NaN
1      Bob  24.0         NaN      NaN
2  Charlie  23.0         NaN      NaN
3      NaN   NaN        92.0      NaN
4      NaN   NaN        88.0      NaN
5      NaN   NaN        95.0     50.0
6      NaN   NaN        88.0      NaN

In [38]:
df.head()

      Name  Age  Test_Score dominoz
0    Alice   22          85    None
1      Bob   24          90    None
2  Charlie   23          78    None

In [39]:
import pandas as pd

# Sample data
data = {
    'Date': ['2022-01-01', '2022-01-01', '2022-01-02', '2022-01-02'],
    'Variable': ['A', 'B', 'A', 'B'],
    'Value': [10, 20, 15, 25]
}

# Creating a DataFrame
do = pd.DataFrame(data)

# Pivot the DataFrame
pivoted_do = do.pivot(index='Date', columns='Variable', values='Value')

# Display the result
print("Original DataFrame:")
print(do)
print("\nPivoted DataFrame:")
print(pivoted_do)

Original DataFrame:
         Date Variable  Value
0  2022-01-01        A     10
1  2022-01-01        B     20
2  2022-01-02        A     15
3  2022-01-02        B     25

Pivoted DataFrame:
Variable     A   B
Date
2022-01-01  10  20
2022-01-02  15  25

Pivot data perform:
index='Date': The 'Date' column becomes the index of the pivoted DataFrame.
columns='Variable': The unique values in the 'Variable' column ('A' and 'B') 
become columns in the pivoted DataFrame.
values='Value': The values in the 'Value' column are used to fill the cells of the pivoted DataFrame.

In [ ]:
#Subset row column

In [40]:
#Select rows 10-20 (df.iloc[1:3]):
# Select rows 1 to 3
selected_rows = df.iloc[1:3]
print("\nSelected Rows (iloc[1:3]):")
print(selected_rows)

Selected Rows (iloc[1:3]):
      Name  Age  Test_Score dominoz
1      Bob   24          90    None
2  Charlie   23          78    None

In [41]:
#Select all columns between 'x2' and 'x4' (inclusive) (df.loc[:, 'x2':'x4']):

In [42]:
# Assume column names are 'x1', 'x2', 'x3', 'x4'
df.columns = ['x1', 'x2', 'x3', 'x4']

# Select columns between 'x2' and 'x4' (inclusive)
selected_columns_range = df.loc[:, 'x2':'x4']
print("\nSelected Columns Between x2 and x4 (inclusive) (loc[:, 'x2':'x4']):")
print(selected_columns_range)

Selected Columns Between x2 and x4 (inclusive) (loc[:, 'x2':'x4']):
   x2  x3    x4
0  22  85  None
1  24  90  None
2  23  78  None

Summarize Data

In [43]:
df.head()

        x1  x2  x3    x4
0    Alice  22  85  None
1      Bob  24  90  None
2  Charlie  23  78  None

In [44]:
# Number of distinct values in column 'w'
x1_nunique = df2['Test_Score'].nunique()
print('\nNumber of distinct values in column Test_Score:')
print(x1_nunique)

Number of distinct values in column Test_Score:
3

In [45]:
df2.head()

   Test_Score  dominoz
0          92      NaN
1          88      NaN
2          95     50.0
3          88      NaN

In [46]:
# Count number of rows with each unique value of variable 'w'
value_counts = df2['dominoz'].value_counts()
print('\nValue counts of column :')
print(value_counts)

Value counts of column :
50.0    1
Name: dominoz, dtype: int64

In [47]:
# Number of rows in DataFrame
df2_length = len(df2)
print('\nNumber of rows in DataFrame:')
print(df2_length)

Number of rows in DataFrame:
4

In [48]:
df2

   Test_Score  dominoz
0          92      NaN
1          88      NaN
2          95     50.0
3          88      NaN

In [49]:
# Sum values of each column
sum_result = df2.sum()
print("Sum of each column:")
print(sum_result)

Sum of each column:
Test_Score    363.0
dominoz        50.0
dtype: float64

In [50]:
# Count non-NA/null values of each column
count_result = df2.count()
print("\nCount of non-NA values in each column:")
print(count_result)

Count of non-NA values in each column:
Test_Score    4
dominoz       1
dtype: int64

In [51]:
# Median value of each column
median_result = df2.median()
print("\nMedian value of each column:")
print(median_result)

Median value of each column:
Test_Score    90.0
dominoz       50.0
dtype: float64

In [52]:
# Quantiles of each column
quantile_result = df2.quantile([0.25, 0.75])
print("\nQuantiles (25% and 75%) of each column:")
print(quantile_result)

Quantiles (25% and 75%) of each column:
      Test_Score  dominoz
0.25       88.00     50.0
0.75       92.75     50.0

In [53]:
# Minimum value in each column
min_result = df2.min()
print("\nMinimum value in each column:")
print(min_result)

Minimum value in each column:
Test_Score    88.0
dominoz       50.0
dtype: float64

In [54]:
# Maximum value in each column
max_result = df.max()
print("\nMaximum value in each column:")
print(max_result)

Maximum value in each column:
x1    Charlie
x2         24
x3         90
x4       None
dtype: object

In [55]:
# Mean value of each column
mean_result = df2.mean()
print("\nMean value of each column:")
print(mean_result)

Mean value of each column:
Test_Score    90.75
dominoz       50.00
dtype: float64

In [56]:
# Variance of each column
var_result = df.var()
print("\nVariance of each column:")
print(var_result)

Variance of each column:
x2     1.000000
x3    36.333333
x4          NaN
dtype: float64

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_5248\3001906676.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  var_result = df.var()

In [57]:

# Standard deviation of each column
std_result = df.std()
print("\nStandard deviation of each column:")
print(std_result)

Standard deviation of each column:
x2    1.000000
x3    6.027714
x4         NaN
dtype: float64

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_5248\2377106531.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  std_result = df.std()

Handling Missing Value

In [58]:
df2.dropna()

   Test_Score  dominoz
2          95     50.0

In [59]:
df2.head()

   Test_Score  dominoz
0          92      NaN
1          88      NaN
2          95     50.0
3          88      NaN

In [60]:
df2.fillna(0)

   Test_Score  dominoz
0          92      0.0
1          88      0.0
2          95     50.0
3          88      0.0

  Logic in Python (and pandas)

In [61]:
# Less than
df2[df2['Test_Score'] < 90]

   Test_Score  dominoz
1          88      NaN
3          88      NaN

In [62]:
# Not equal to
df2[df2['Test_Score'] != 88]

   Test_Score  dominoz
0          92      NaN
2          95     50.0

In [63]:
# Greater than
df2[df2['Test_Score'] > 90]

   Test_Score  dominoz
0          92      NaN
2          95     50.0

In [64]:
# Group membership
values = [88, 95]
df2[df2['Test_Score'].isin(values)]

   Test_Score  dominoz
1          88      NaN
2          95     50.0
3          88      NaN

In [65]:
# Equals
df2[df2['Test_Score'] == 92]

   Test_Score  dominoz
0          92      NaN

In [66]:
# Is NaN
df2[pd.isnull(df2['dominoz'])]

   Test_Score  dominoz
0          92      NaN
1          88      NaN
3          88      NaN

In [67]:
# Less than or equals
df2[df2['Test_Score'] <= 92]

   Test_Score  dominoz
0          92      NaN
1          88      NaN
3          88      NaN

In [68]:
# Greater than or equals
df2[df2['Test_Score'] >= 92]

   Test_Score  dominoz
0          92      NaN
2          95     50.0

# Logical and &, Logical or |, Logical not ~, Logical xor ^, df.any(), df.all():

In [69]:
# Logical and
df2[(df2['Test_Score'] > 90) & (df2['dominoz'] > 0)]

   Test_Score  dominoz
2          95     50.0

In [70]:
# Logical or
df2[(df2['Test_Score'] > 90) | (df2['dominoz'] > 0)]

   Test_Score  dominoz
0          92      NaN
2          95     50.0

In [77]:
# Logical not
df2[~(df2['Test_Score'] == 88)]

   Test_Score  dominoz
0          92      NaN
2          95     50.0

In [72]:
# Logical xor
df2[(df2['Test_Score'] > 90) ^ (df2['dominoz'] > 0)]

   Test_Score  dominoz
0          92      NaN

In [73]:
# Check if any value in 'Test_Score' column is greater than 90
df2['Test_Score'].any()

True

In [74]:
# Check if all values in 'Test_Score' column are greater than 90
df2['Test_Score'].all()

True

Group Data

In [75]:
df2.head()

   Test_Score  dominoz
0          92      NaN
1          88      NaN
2          95     50.0
3          88      NaN

import pandas as pd
import numpy as np

# Creating the DataFrame
data = {'Test_Score': [92, 88, 95, 88],
        'dominoz': [np.nan, np.nan, 50.0, np.nan]}
df2 = pd.DataFrame(data)

# Group by 'Test_Score'
grouped_by_test_score = df2.groupby(by='Test_Score')

# Group by index (assuming you have an index named 'ind')
grouped_by_index = df2.groupby(level=0)

# Additional GroupBy functions
# Element-wise max
max_result = grouped_by_test_score.max()
print("Element-wise max:")
print(max_result)

# Trim values at input thresholds
clip_result = grouped_by_test_score.NaN(lower=-10, upper=10)
print("\nTrim values at input thresholds:")
print(clip_result)

# Element-wise min
min_result = grouped_by_test_score.min()
print("\nElement-wise min:")
print(min_result)

# Absolute value
abs_result = grouped_by_test_score.abs()
print("\nAbsolute value:")
print(abs_result)

# Expanding object for cumulative summary functions
expanding_result = df.expanding().sum()
print("\nExpanding object for cumulative summary functions:")
print(expanding_result)

# Rolling object for summary functions on windows of length n
rolling_result = df.rolling(window=2).sum()
print("\nRolling object for summary functions on windows of length n:")
print(rolling_result)

# Size of each group
size_result = grouped_by_test_score.size()
print("\nSize of each group:")
print(size_result)